# GetOperators Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormulaManager..::..GetOperators Method
FormulaManager Class See Also
---
Gets list of operator names supported by formula engine
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static IList<string> GetOperators()
```

Visual Basic
---
```text
Public Shared Function GetOperators As IList(Of String)
```

Visual C++
---
```text
public:
static IList<String^>^ GetOperators()
```

# See Also
FormulaManager Class
Autodesk.Revit.DB Namespace